import math, os


inpA = float(input('Введіть сторону a:'))      # Вводимо сторони, переводимо в числовий формат з плаваючою комою
inpB = float(input('Введіть сторону b:'))
inpC = float(input('Введіть сторону c:'))
p = (a + b + c)/2                       # Обчислюємо півпериметр трикутника
S = sqrt(p*(p-a)*(p-b)*(p-c))           # Обчислюємо площу трикутника
r = S/p                                 # Знаходимо радіус вписаного кола
R = a*b*c/(4*S)                         # Знаходимо радіус описаного кола
bisA = sqrt(b*c*(a+b+c)*(b+c-a))/(b+c)  # Обчислюємо бісектрису, опущену на А
bisB = sqrt(a*c*(a+b+c)*(a+c-b))/(a+c)  # Обчислюємо бісектрису, опущену на В
bisC = sqrt(a*b*(a+b+c)*(a+b-c))/(a+b)  # Обчислюємо бісектрису, опущену на С
print('')                               # Виведення порожньої стрічки "для краси"
print('Бісектриса кута А дорівнює', round(bisA, 3))     # Виводимо необхідні дані, округлені до 3 знаків
print('Бісектриса кута B дорівнює', round(bisB, 3))
print('Бісектриса кута C дорівнює', round(bisC, 3))
print('Радіус вписаного кола:', round(r, 5))            # Виводимо необхідні дані, округлені до 5 знаків
print('Радіус описаного кола:', round(R, 5))

os.system('pause')                      # Пауза, щоб користувач встиг прочитати виведені дані
